See [https://pypi.org/project/ipython-sql/](https://pypi.org/project/ipython-sql/) to find out more on how to use ipython-sql extension

In [1]:
%load_ext sql

In [5]:
# connect to db
%sql postgresql://postgres:postgres@db:5432/postgres

In [11]:
# single line query
%sql select id, libelle, typezone, insee from public_data_zoneurba pdz limit 3;

 * postgresql://postgres:***@db:5432/postgres
3 rows affected.

[(1355729, 'Ah', 'A', '32147'),
 (486661, 'N', 'N', '38257'),
 (1355760, 'N', 'N', '32147')]

In [14]:
# using multi lines query

In [15]:
%%sql select pdz.id, pdz.origin_insee, pdc.id as commune_id, pdc.insee, ST_Area(ST_Transform(ST_Intersection(pdc.mpoly, pdz.mpoly), 2154)) as area
from public_data_zoneurba as pdz
inner join public_data_commune as pdc on ST_Intersects(pdz.mpoly, pdc.mpoly)
limit 10;

 * postgresql://postgres:***@db:5432/postgres
10 rows affected.

[(1355729, None, 11988, '32147', 3603.472278945657),
 (486661, None, 14069, '38047', 2944.596791721538),
 (486661, None, 14477, '38498', 30919.517841298293),
 (486661, None, 14256, '38257', 5424638.237172062),
 (486661, None, 14066, '38044', 1811051.503960022),
 (486661, None, 14158, '38147', 1829478.15389549),
 (486661, None, 14246, '38246', 1027294.467023069),
 (486661, None, 14447, '38464', 2756059.1869664895),
 (486661, None, 14060, '38038', 699831.5606788923),
 (486661, None, 14117, '38098', 17613.937424635045)]

In [21]:
# using parameters
name = 'Saint-Michel'
%sql select id, name, insee from public_data_commune where name = :name limit 5

 * postgresql://postgres:***@db:5432/postgres
5 rows affected.

[(12235, 'Saint-Michel', '32397'),
 (13118, 'Saint-Michel', '34278'),
 (5476, 'Saint-Michel', '16341'),
 (16691, 'Saint-Michel', '45294'),
 (3080, 'Saint-Michel', '09271')]